{
    "bot_messages" : 
    {
        "start_message_under_10_members" : "The Trust No Bunny bot is now active in this server! Count Cornelio’s caravan will make stops here once the server has reached at least 10 members. To roll for the current drop, use the {roll_command} command. Use {channel_set_command} to set which channel the caravn will stop in. To redeem rewards using your ill-gotten gains, go to play.friendlypixel.com",
        "start_message_10_members": "The Trust No Bunny bot is now active in this server! Count Cornelio’s caravan will make stops here once the server has reached at least 10 members. To roll for the current drop, use the {roll_command} command. Use {channel_set_command} to set which channel the caravn will stop in. To redeem rewards using your ill-gotten gains, go to play.friendlypixel.com",
        "caravan_stop": "The nefarious Count Cornelio’s caravan is stopping in town for the night. Dare you help yourself to some of his ill gotten gains? ! Use ${rollText} to infilrate and look for treasure!"
    },
    "command_interactions" :
    {
        "roll_command" : 
        {
            "name": "/roll",
            "description": "Rolls for the current drop.",
            "no_drop": "I'm sorry, we couldn't find a caravan to raid this server",
            "already_raided": "I'm sorry, it looks like you've already raided this caravan. Come back later for more chances.",
            "rolling_dice": "Rolling a 20 sided dice...",
            "rolled_1": "You rolled a 1! Bad luck, no server modifier applied!",
            "rolled_1_found": "You found nothing! Check back later when the caravan stops again.",
            "rolled_result": "You rolled a {diceroll}! Your server size modifer is {server_size_modifier} for a total of {combined}",
            "rolled_found": "You found {reward_title}. Redeem in Trust No Bunny (play.friendlypixel.com). Ensure your Discord is connected in-game to see your reward."
        }, 
        "channel_set_command" : 
        {
            "name": "/channel set",
            "description": "Sets the channel where the caravan will stop.",
            "message": "Default channel for drops has been successfully set"
        }, 
        "droptable_command" : 
        {
            "name": "/droptable",
            "description": "Shows the current drop table.",
            "base_dice_roll_requirements": "Here are the base dice roll requirements for each item in the drop table for a server of size {server_size}:\n\n",
            "server_size_modifier": "\nThe server size modifier for this server is {server_size_modifier}.\n\n"
        },
        "help_command" : 
        {
            "name": "/help",
            "description": "Help with the Count Cornelio bot",
            "message" : "When the Trust No Bunny bot is installed in your server, the nefarious Count Cornelio’s caravan will start making stops here. When he makes a stop, use the {roll_command} command to raid his caravan. Use {channel_set_command} to set which channel the caravn will stop in. Use {droptable_command} to see what the roll amounts grant you. You can only raid a caravan once each time it stops by, but there's no limit to the number of servers you can use to redeem rewards. To redeem rewards using your ill-gotten gains, go to play.friendlypixel.com"
        }
      
    },
    "roll_responses" : 
    {
      "Natural_1": [
        "In a clumsy move with the candle of the holy carrot, you accidentally illuminated the caravan, revealing your position to the baron's guards.",
        "Naively thinking the sword of unlimited power would make you invisible, you walked straight into the baron's guards. They're now laughing and pointing.",
        "Your stubborn plan to use the ear horn to eavesdrop on the caravan backfired. Instead of secrets, all you heard was a vendor selling cabbages.",
        "The crystal ball of dubious portents showed the caravan unguarded. You didn't realize it was showing yesterday. Today, there's double the guards.",
        "In your greed, you followed the mystical recipe, thinking it would reveal the baron's hidden stash. It led you straight into a pitfall trap instead.",
        "While attempting to use Patchy's tools to jimmy a lock, you clumsily snapped one in the keyhole, alerting nearby guards.",
        "Your approach to the caravan seemed stealthy, until your path crossed with a curious wolf, leading the baron's guards straight to you.",
        "Believing the shiny medallion would distract the guards, you tossed it into the distance. A guard fetched it and gave it back, patting you on the head mockingly.",
        "Using the sword of unlimited power, you attempted to make a dramatic entrance. Instead, you sliced through a barrel of honey, getting yourself stuck.",
        "Hoping the ear horn would amplify the guards' whispers, you accidentally blew into it, producing a comically loud sound that attracted attention.",
        "With the mystical recipe in hand, you approached a seemingly unguarded caravan. Turns out it was a food cart, and now you owe them for a meal.",
        "Determined to sneak past the baron's main guards, you encountered a Werebunny in disguise. Your cover's blown, and there's a lot of hopping around.",
        "Clumsily trying to set the snap trap 2000 as a distraction, you got your own foot caught in it, leaving you hopping in circles.",
        "Patchy's tools seemed perfect to disable the caravan's alarms. Your naive trust had you tinkering with a musical instrument instead, serenading the entire camp.",
        "In the caravan's shadow, you lit the candle of the holy carrot for guidance. A gust of wind blew it out, and now you're fumbling in the dark.",
        "Hoping the crystal ball of dubious portents would reveal guard movements, it instead showed you tripping on a rope. Moments later, reality matched the vision.",
        "The shiny medallion's gleam was supposed to guide you. Instead, it reflected moonlight, spotlighting your position to every guard around.",
        "You thought the sword of unlimited power could cut through any caravan lock. Instead, it got lodged in a wooden beam, and you're tugging comically at it.",
        "A Werebunny whispered of treasures in a specific caravan tent. Greedily, you entered, only to find it was a trap, and now you're in a net.",
        "The snap trap 2000 seemed like the perfect distraction. Until you realized it's just a toy in this world, and guards are now chuckling at your naive attempt."
      ],
      "Roll_2_10": [
        "While trying to ignite the candle of the holy carrot, a gust of wind kept blowing it out. After several attempts, you decided it wasn't worth the risk.",
        "Swinging the sword of unlimited power to fend off a suspicious crow, you drew more attention than you anticipated.",
        "You naively used the ear horn and misheard the guards' chat about 'golden pies'. Hungry and distracted, you nearly bumped into one!",
        "The crystal ball of dubious portents showed fog enveloping the caravan. When you arrived, it was clear as day and twice as guarded.",
        "Misreading the mystical recipe, you accidentally started a small campfire. The smell of burnt marshmallows wasn't the stealthy approach you intended.",
        "The shiny medallion, while beautiful, kept catching the moonlight. You spent more time hiding its glint than sneaking!",
        "You set the snap trap 2000 nearby, but its snap was... underwhelming. The guards chuckled and called it cute.",
        "Using Patchy's tools, you found a secret passage. Halfway through, you realized it's just an outhouse. Oh, the smell!",
        "Your stubborn attempt to lure guards away with carrot trails only succeeded in attracting a group of hungry bunnies.",
        "A clumsy drop of the candle of the holy carrot sent you on a wild chase. By the time you got it back, dawn was near.",
        "Attempting to use the sword of unlimited power as a makeshift pole vault, you miscalculated and got stuck in a tree. At least the view's nice!",
        "You hoped the ear horn would pick up secrets. Instead, it only amplified the snores of a guard. Not the intel you were hoping for.",
        "The mystical recipe seemed like a pathway to riches. Instead, it was a soup recipe and left you craving rather than thieving.",
        "Believing the shiny medallion would grant invisibility, you marched confidently. Until a guard asked if you're part of the evening's entertainment.",
        "Using the snap trap 2000 to block a tent's entrance, it was quickly disarmed by a kid, fascinated by its mechanism.",
        "You tried to dig under the caravan with Patchy's tools but only found a buried stash of... carrots. Well, dinner's sorted.",
        "The sword of unlimited power began glowing ominously. You hid, thinking it would deter guards. Instead, they started taking bets on what it was.",
        "Greedy for a quick steal, you misjudged a leap and found yourself tangled in a clothesline, donned in freshly laundered guard uniforms.",
        "With the ear horn pressed to the ground, you hoped to hear footsteps. Instead, the ground vibrated with distant wolf howls, unsettling you.",
        "The crystal ball of dubious portents showed an empty tent. Inside? A very annoyed cat and a torn map. Not the treasure you envisioned.",
        "Hoping to trade the shiny medallion for a clue, a merchant gave you... another medallion. Looks like you were out-bargained!",
        "You snuck into a tent, thinking it held treasures, but found a bunch of Werebunnies in a heated card game. Quietly, you backed out.",
        "The snap trap 2000, when placed, immediately snapped on a rogue squirrel. It glared at you, chattering away its frustration.",
        "Patchy's tools seemed perfect for prying open a chest. It was stubbornly locked, and by the time you gave up, dawn was breaking.",
        "Using the candle of the holy carrot for light, you stumbled upon a wolf's camp. Not the caravan, but at least you snagged a tasty rabbit stew!",
        "With the sword of unlimited power, you hoped to cut a quiet entryway. Instead, you sliced a tent's support, causing a noisy and comical collapse.",
        "You blew into the ear horn to mimic a wolf's howl, intending to scare guards. Instead, you got an orchestra of various animal replies.",
        "Studying the mystical recipe under moonlight, you realized it's a family dessert recipe. At least you won't leave empty-handed!",
        "The shiny medallion got stuck in a tree. In your attempts to retrieve it, a guard asked if you needed a ladder, cheekily.",
        "With the snap trap 2000 set, you waited for the distraction. Instead, a group of children started playing with it, rendering your plan moot.",
        "Patchy's tools seemed a perfect fit for a suspicious lockbox. After minutes of tinkering, it popped open to reveal... sewing supplies.",
        "The stubborn decision to use the candle of the holy carrot inside a tent revealed it was a storehouse of... more candles. Irony at its finest.",
        "Attempting to swing from a tree with the sword of unlimited power, you missed the caravan entirely, landing in a haystack.",
        "Your greedy eyes spied a tent brimming with gold, only to find it was a merchant's stand selling golden-hued fabrics.",
        "The crystal ball of dubious portents revealed an unguarded path. Unfortunately, it was atop a very slippery hill. The descent wasn't graceful.",
        "The shiny medallion, when thrown as a distraction, was quickly picked up by a playful puppy, turning your heist into a game of fetch.",
        "As you were about to utilize the snap trap 2000, a guard approached, asking if you needed help setting it up.",
        "Using Patchy's tools, you attempted to cut a hole in the caravan's canvas. Too bad it was the side facing the campfire, casting a perfect shadow puppet of your act.",
        "Hearing guards discuss a Werebunny, you pressed the ear horn harder, cracking it in the process. Now you'll never know the Werebunny's identity!",
        "Your naive faith in the sword of unlimited power's stealth led you into a comedy act of tripping over your own cloak and startling a group of chickens."
      ],
      "Roll_11_15": [
        "Using the candle of the holy carrot, you spotted a secret compartment, revealing a modest stash of coins.",
        "Wielding the sword of unlimited power, you cut through the caravan's defenses, making off with a sack of valuables.",
        "The ear horn allowed you to eavesdrop on guards discussing the caravan's weakest points. Capitalizing on this, you secured a decent haul.",
        "The crystal ball of dubious portents showed a distraction happening soon. True enough, a group of performers arrived, and you sneaked in undetected.",
        "Following the mystical recipe, you brewed a potion granting brief invisibility. It worked, but not long enough to grab the most valuable items.",
        "You flashed the shiny medallion as a badge of authority, bluffing your way into the caravan. You left with pockets slightly heavier.",
        "Setting up the snap trap 2000, you caught a couple of guards, giving you just enough time to snatch some goodies.",
        "With Patchy's tools, you dismantled a few locks, gaining access to some personal chests. Inside, a mix of coins and curious trinkets awaited.",
        "The candle of the holy carrot revealed an old map tucked away. It might lead to greater treasures or just be decorative art.",
        "You deftly wielded the sword of unlimited power, impressing a few guards who let you in for a closer look at it. You took the chance to snatch a few loose valuables.",
        "Clumsily tripping near the ear horn, you accidentally stumbled upon a stash of goods hidden underneath a wagon.",
        "The mystical recipe led you to brew a calming aroma. While the guards were in a daze, you helped yourself to some loot.",
        "Wearing the shiny medallion as a necklace, you masqueraded as a foreign merchant. The guards were too enamored to notice your thieving hands.",
        "A naive young guard was fascinated by the snap trap 2000, allowing you to distract him and secure some goods.",
        "Using Patchy's tools, you managed to fix a wagon's broken wheel. Grateful, the caravan let you pick an item as thanks. Little did they know you had your eyes on more.",
        "You lit the candle of the holy carrot near a group of Werebunnies playing dice. The shifting shadows distracted them long enough for you to snatch their pot.",
        "A greedy guard tried to take the sword of unlimited power from you. In the ensuing struggle, you discovered a hidden pouch of coins.",
        "You blew into the ear horn, creating an eerie wind sound. Superstitious guards ran off, letting you briefly raid the scene.",
        "The crystal ball of dubious portents showed a wolf lurking nearby. You took advantage of the ensuing panic to pocket some treasures.",
        "With the mystical recipe, you concocted a sneezing powder. The caravan's sneezing fit was music to your thieving ears.",
        "The shiny medallion acted as a magnet for curious onlookers. You used this to your advantage, sneaking into tents while they were distracted.",
        "Setting the snap trap 2000 as a perimeter, you managed to snag a few valuables before it was disarmed.",
        "Patchy's tools were perfect for unscrewing ornate fittings from the caravan. They might fetch a good price!",
        "You stubbornly insisted that the candle of the holy carrot could unveil hidden treasures. To your surprise, it illuminated a concealed drawer.",
        "The sword of unlimited power drew the eyes of many. Amidst the attention, you managed to nab a pouch left unattended.",
        "Your ear horn picked up a whispered trade between merchants. Following the lead, you found a stash they were trying to hide.",
        "The crystal ball of dubious portents clouded up when near a particular tent. Inside, a small cache of gems awaited you.",
        "Misreading the mystical recipe, you accidentally caused a bubbly commotion. As onlookers laughed at the mess, you swiped a nearby coin purse.",
        "The shiny medallion reflected the campfire in a mesmerizing dance of lights. Under its spell, you managed to grab some precious items.",
        "The snap trap 2000 went off, catching only a boot. But that boot had a hidden pocket with a nifty trinket inside.",
        "While the caravan admired Patchy's tools, believing them to be artifacts, you discreetly pilfered a few items.",
        "Near the edge of camp, the candle of the holy carrot revealed wolf tracks. You followed them to a stash of stolen goods, reclaiming some for yourself.",
        "Your display of the sword's power had some guards handing over their valuables just to avoid any trouble.",
        "A stubborn attempt to use the ear horn as a speaking device resulted in hilarious echoes, distracting the guards and allowing a sneaky raid.",
        "The crystal ball of dubious portents unexpectedly floated, drawing a crowd. Amid the chaos, you snagged a few goodies.",
        "The mystical recipe transformed a pot of stew into a thick glue. You spread it around, slowing down pursuers as you took what you could.",
        "The shiny medallion's glow lured in a few stray bunnies, causing a fluffy diversion perfect for some light pilfering."
      ],
      "Roll_16_19": [
        "In the dark corners of the caravan, the candle of the holy carrot illuminated a secret stash of rare gemstones, yours for the taking.",
        "With the sword of unlimited power in hand, you confidently strode into the caravan, parting guards as they stood in awe, and collected a hoard of treasures.",
        "The ear horn revealed a whispered conversation about the baron's private vault. Slipping inside, you filled your bags with immense wealth.",
        "Peering into the crystal ball of dubious portents, you foresaw the caravan's layout. With this insight, you navigated through traps, amassing a significant haul.",
        "Following the mystical recipe, you conjured a smokescreen. Emerging from the smoke, you held treasures that dazzled even the most seasoned thieves.",
        "Flashing the shiny medallion, you hypnotized the guards. They obediently handed over the caravan's most prized possessions.",
        "Deploying the snap trap 2000, it caught the baron himself! While he struggled, you plundered the caravan's richest sections.",
        "Using Patchy's tools, you ingeniously disabled the caravan's alarms, granting you unfettered access to valuable artifacts and coins.",
        "A clumsy merchant spilled wine on a map, revealing hidden markings with the candle of the holy carrot. Following it, you discovered a cache of gold bars.",
        "With a swing of the sword of unlimited power, you effortlessly disarmed the guards, claiming the baron's personal treasures as your prize.",
        "Greedy whispers focused on a chest with a peculiar lock. Using the ear horn to replicate its unlocking sound, you accessed its bountiful contents.",
        "The crystal ball of dubious portents shimmered, revealing the baron's treasure room. Swiftly, you emptied its vast riches into your satchel.",
        "The mystical recipe transformed a mundane broth into a potion of charm. Everyone willingly handed over their valuables, mesmerized by your presence.",
        "Your shiny medallion outshone all other treasures, distracting the caravan's denizens as you lifted their most treasured items.",
        "The snap trap 2000 snapped shut, ensnaring the baron's personal guard. In the resulting chaos, you nabbed the caravan's crown jewels.",
        "Patchy's tools made quick work of even the toughest safes. Inside, you found treasures even legends would envy.",
        "In the camp's center, the candle of the holy carrot revealed an underground passage. It led directly to a vault of unimaginable wealth.",
        "A naive merchant challenged you to a duel, not knowing the sword you wielded. After your easy victory, the camp rewarded you generously.",
        "Using the ear horn, you overheard the password to a guarded tent. Inside, treasures from distant lands awaited your deft touch.",
        "The crystal ball of dubious portents directed you to a guarded tent. By skillfully evading its sentinels, you seized an artifact of ancient power.",
        "After cooking up a feast with the mystical recipe, you were gifted a chest of valuables as thanks. Little did they know, you took a bit more on the side.",
        "The shiny medallion attracted a dragonfly swarm, which entranced the camp. Under this natural spectacle, you secured a king's ransom in loot.",
        "You stubbornly refused to reveal how the snap trap 2000 worked, creating a commotion. Amidst the distraction, you ransacked the baron's personal tent.",
        "A guard tried to confiscate Patchy's tools, thinking them to be of great value. While he was busy examining them, you relieved him of his purse and more.",
        "Using the candle of the holy carrot, you uncovered an encrypted message. Deciphering it, you located a secret stash, heavy with gold and silver.",
        "A group of Werebunnies sought to challenge the might of your sword. They quickly fled, leaving behind their stolen treasures for you to reclaim.",
        "The ear horn's amplification startled a group of merchants. In the pandemonium, you easily slipped into their tents, gathering riches galore.",
        "Peering into the crystal ball of dubious portents, you convinced the caravan it was cursed. As they fled in panic, you calmly gathered your spoils.",
        "The mystical recipe turned water into wine. Impressed, the caravan gifted you bags of coins and precious artifacts.",
        "Dazzled by the shiny medallion's glow, guards permitted you entry into the caravan's inner sanctum. There, treasures beyond imagination awaited.",
        "The snap trap 2000 captured a wolf scout, sending the camp into celebration. Grateful for the added security, they rewarded you with chests of valuables.",
        "Using Patchy's tools, you constructed a device that fascinated the camp. As they fiddled with it, you stealthily cleared out their coffers.",
        "Lighting the candle of the holy carrot, you narrated tales of ancient bunny heroes. Moved by your stories, the caravan generously shared their wealth.",
        "With the sword of unlimited power raised, you declared a contest. No one dared challenge you, instead they offered treasures for your amusement.",
        "A stubborn merchant believed your ear horn to be a legendary relic. Selling it for a small fortune, you later stole it back, gaining both gold and horn.",
        "Through the crystal ball of dubious portents, you showed the caravan glimpses of their future. Grateful for the insights, they gifted you their finest treasures."
      ],
      "Roll_Nat_20": [
        "Swinging the sword of unlimited power, you not only cleared a path to the caravan's core treasures, but also inadvertently gave the baron a hilarious haircut.",
        "The candle of the holy carrot shone so bright that the baron mistakenly believed it to be the dawning of a new day and prematurely ended his operations, allowing you to take everything.",
        "Using the ear horn, you overheard the baron singing in the shower about his secret vault's location. You swiftly raided it, leaving behind a rubber ducky in its place.",
        "The crystal ball of dubious portents showed the baron slipping on a banana peel. You planted one in his path and, while he comically flailed, you robbed him blind.",
        "Following the mystical recipe, you whipped up a carrot cake so delicious that the entire caravan threw a party in your honor, gifting you with a mountain of treasures.",
        "Wearing the shiny medallion, you became the star of the show. The baron, in a fit of jealousy, bet all his wealth in a dance-off and lost spectacularly to your bunny hop.",
        "Deploying the snap trap 2000, it surprisingly caught a clumsy Werebunny disguised as the baron. The real baron, grateful for the reveal, gifted you his most treasured items.",
        "Using Patchy's tools, you inadvertently set off a chain reaction of comical mishaps in the caravan. The baron, laughing uncontrollably, handed over his valuables just to see what you'd do next.",
        "The candle of the holy carrot illuminated a secret passage under the baron's tent, leading to his embarrassing diary. With that kind of leverage, he willingly handed over his treasures.",
        "With the sword of unlimited power, you accidentally split a coin, revealing it to be part of the baron's counterfeit operation. The town rewarded you handsomely for uncovering the scam.",
        "Your ear horn amplified a fart from the baron's tent, causing a ripple of laughter through the camp. In his embarrassment, he threw you a chest of treasures just to divert attention.",
        "The crystal ball of dubious portents showed the baron tripping over his own robe. Sure enough, he did, revealing a key to his treasure chest which you quickly 'borrowed'.",
        "Whipping up a brew with the mystical recipe, the baron became insatiably hungry. As he raided the food tent, you raided his treasury.",
        "The shiny medallion reflected sunlight into the baron's eyes, making him see 'flying carrots'. He traded his riches just for a glimpse of the imaginary vegetable.",
        "The snap trap 2000 went off, revealing not treasures but the baron's secret collection of cute bunny slippers. He paid you handsomely to keep it a secret.",
        "You swapped Patchy's tools with the baron's scepter in a game of 'hide & seek'. He was so amused that he let you keep both.",
        "While trying to use the ear horn to listen in on the baron's plans, you mistakenly blew into it, causing a hilarious sound that made the entire caravan burst into laughter. The baron, in good spirits, awarded you a sack of silver."
      ]
    }
}
