{
    "bot_messages" : 
    {
        "start_message_under_10_members": "Trust No Bunny ボットがこのサーバーで活動を開始しました！ カウント・コルネリオのキャラバンは、サーバーが少なくとも10人のメンバーに達した場合にここで停車します。現在のドロップをロールするには、{roll_command}コマンドを使用してください。キャラバンが停車するチャンネルを設定するには、{channel_set_command}を使用してください。不正得な利益を使用して報酬を引き換えるには、play.friendlypixel.comにアクセスしてください。",
        "start_message_10_members": "Trust No Bunny ボットがこのサーバーで活動を開始しました！ カウント・コルネリオのキャラバンは、サーバーが少なくとも10人のメンバーに達した場合にここで停車します。現在のドロップをロールするには、{roll_command}コマンドを使用してください。キャラバンが停車するチャンネルを設定するには、{channel_set_command}を使用してください。不正得な利益を使用して報酬を引き換えるには、play.friendlypixel.comにアクセスしてください。",
        "caravan_stop": "邪悪なカウント・コルネリオのキャラバンが今夜、町で停車しています。彼の不正得な利益の一部を自分のものにしてもいいですか？{roll_command}を使用して潜入し、宝を探してください！"
    }   ,
    "command_interactions" :
    {
        "language_command" :
        {
            "name": "/言語",
            "description": "ボットの言語を設定します。",
            "language_set": "ボットの言語が正常に設定されました。"
        },
        "roll_command" : 
        {
            "name": "/サイコロ",
            "description": "バロンのキャラバンに侵入するために20面のサイコロを振る",
            "no_drop": ": 申し訳ありませんが、このサーバーで襲撃するキャラバンが見つかりませんでした。",
            "already_raided": "申し訳ありませんが、既にこのキャラバンは襲撃済みのようです。後で再度試してみてください。",
            "rolling_dice": "20面のサイコロを振ります…",
            "rolled_1": "1を出しました！残念ながら、サーバーの補正は適用されません！",
            "rolled_1_found": "何も見つかりませんでした！次回キャラバンが停まる時をお待ちください。",
            "rolled_result": "{diceroll}を出しました！サーバーのサイズ補正は{server_size_modifier}、合計は{combined}です。",
            "rolled_found": "{reward_title}を見つけました。Trust No Bunny（play.friendlypixel.com）で引き換えてください。ゲーム内でDiscordを接続している場合のみ、報酬が表示されます。"
        }, 
        "channel_set_command" : 
        {
            "name": "/チャンネル 設定",
            "description": "カウント・コルネリオのキャラバンが停止するチャンネルを設定します。",
            "channel_set_option": "カウント・コルネリオのキャラバンが停止するチャンネル",
            "message": "カウント・コルネリオのキャラバンのデフォルトチャンネルが正常に設定されました"
        }, 
        "droptable_command" : 
        {
            "name": "/ドロップテーブル",
            "description": "ドロップテーブルの各アイテムに必要なサイコロの要件を取得します。",
            "base_dice_roll_requirements": "{server_size}サイズのサーバーにおけるドロップテーブルの各アイテムの基本的なサイコロの要件は以下のとおりです：\n\n",
            "server_size_modifier": "\nこのサーバーのサーバーサイズ修正は{server_size_modifier}です。\n\n"
        },
        "help_command" : 
        {
            "name": "/ヘルプ",
            "description": "Trust No Bunny ボットのヘルプ",
            "message": "Trust No Bunny ボットがあなたのサーバーにインストールされたとき、悪名高いカウント・コルネリオのキャラバンがこちらで停まり始めます。彼が停まったら、{roll_command} コマンドを使用して彼のキャラバンを襲撃してください。{channel_set_command}を使用してキャラバンが停まるチャンネルを設定します。{droptable_command}を使用して、ロールの金額が何を提供するかを確認してください。キャラバンは停まるたびに一度しか襲撃できませんが、報酬を受け取るために使用できるサーバーの数に制限はありません。不正に得た利益を使用して報酬を受け取るには、play.friendlypixel.comにアクセスしてください。"
        }
    },
    "roll_responses" : 
    {
      "Natural_1":[
        "神聖なにんじんのキャンドルを不器用に使ってキャラバンを照らしてしまい、男爵の護衛に位置を知られてしまいました。",
        "無限パワーの剣があなたを透明にすると思い込んで、男爵の護衛に直接歩み寄りました。彼らは今、笑って指差しています。",
        "スナップトラップ2000を仕掛ける途中で足を挟んでしまい、何も得られませんでした。",
        "パッチーのツールでロックを解除しようとしたが、道具が壊れてしまった。",
        "怪しい前触れのクリスタルボールを使って未来を見ようとしたが、何も見えなかった。",
        "侦察兵号角で警報を鳴らしてしまい、一切の隠密行動が失敗しました。",
        "新力奖章を使って勇気を出そうとしたが、代わりに自分を照らしてしまいました。",
        "玄秘药剂のレシピを読んでみたが、全く理解できなかった。",
        "胡萝卜圣烛で照明をつけようとしたが、炎が消えてしまいました。",
        "大力巨剑で敵を倒そうとしたが、代わりに剣が折れてしまいました。",
        "パッチーのツールで箱を開けようとしたが、中には何も入っていなかった。",
        "スナップトラップ2000で罠を仕掛けたが、自分が引っかかってしまった。",
        "怪しい前触れのクリスタルボールで運勢を占ったが、結果は最悪だった。",
        "侦察兵号角を吹いて味方を呼ぼうとしたが、敵が来てしまった。",
        "新力奖章をつけたが、それが原因で敵に見つかってしまった。",
        "神秘のレシピで魔法のポーションを作ろうとしたが、失敗に終わった。",
        "胡萝卜圣烛で道を照らそうとしたが、逆に目立ってしまった。",
        "大力巨剑を振ってみたが、何も起こらなかった。",
        "パッチーのツールで罠を仕掛けようとしたが、逆に罠にかかってしまった。",
        "スナップトラップ2000を設置しようとしたが、間違って自分の足に仕掛けてしまった。"
    ],
      "Roll_2_10": [
        "神聖なにんじんのキャンドルでほんの少し明るい場所を見つけ、そこに少量の銀貨を発見しました。",
        "無限パワーの剣でカラバンの防御をわずかに切り裂き、少量の銀貨を持ち帰りました。",
        "神秘のレシピを使って、少量の銀貨を調合しました。",
        "パッチーのツールで少しの時間を費やし、結局は少量の銀貨を手に入れました。",
        "キラキラメダルを見せながら、気を逸らして少量の銀貨を拾いました。",
        "スナップトラップ2000でトラップを仕掛け、小さな報酬を得ました。",
        "ミニホルンで周囲を注意深く見て、少量の銀貨を見つけました。",
        "怪しい前触れのクリスタルボールで未来を予知し、少量の銀貨を見つけました。",
        "侦察兵号角を吹きながら、少量の銀貨を見つけました。",
        "妖气水晶球を使って、わずかな銀貨を発見しました。",
        "スナップトラップ2000で小さな罠を作り、少量の銀貨を獲得しました。",
        "神聖なにんじんのキャンドルで隠れた場所を見つけ、少量の銀貨を手に入れました。",
        "無限パワーの剣で少量の銀貨を切り取りました。",
        "神秘のレシピで作った薬を使い、少量の銀貨を手に入れました。",
        "侦察兵号角を鳴らし、少量の銀貨を見つけました。",
        "修补匠的工具で少量の銀貨を修理しました。",
        "新力奖章を使って、少量の銀貨を手に入れました。",
        "玄秘药剂を使って、少量の銀貨を手に入れました。",
        "捕猎陷阱 2000で少量の銀貨を捕獲しました。",
        "大力巨剑で少量の銀貨を手に入れました。"
      ],
      "Roll_11_15": [
        "金の剣で軽い敵を討ち、いくらかの報酬を得ました。",
        "光のペンダントで秘密の扉を照らし、何か貴重なものを発見しました。",
        "銅のトラップで小さな獲物を捕まえ、少量の貴重品を手に入れました。",
        "小型の角笛で敵の動きを見つけ、それなりの報酬を得ました。",
        "基本の薬のレシピで健康薬を作り、少額の報酬を得ました。",
        "クリスタルオーブでちょっとした未来を覗き見、小さな財宝を発見しました。",
        "修繕用の糸で服を繕い、感謝され少量の金貨を得ました。",
        "勇気のメダルを見せて、わずかな報酬と称賛を受けました。",
        "基本の魔法薬で小さな奇跡を起こし、少量の宝石を得ました。",
        "短剣で襲いかかる敵を撃退し、近くの村人から感謝と報酬を得ました。",
        "手裏剣で遠くの目標に命中させ、少額の報酬を獲得しました。",
        "小さなシールドで味方を守り、感謝されました。",
        "口笛で美しいメロディを奏で、少量の金貨と一緒に感謝を受けました。",
        "スリングショットで果物を手に入れ、少量の食糧と共に感謝されました。",
        "革の背当てで命中精度を上げ、狙った目標に成功しました。",
        "丸太の橋を修理し、通行料として小額の報酬を得ました。",
        "簡単な石の罠で動物を捕らえ、少量の食糧を得ました。",
        "手作りのコンパスで道を見つけ、目的地に辿り着きました。",
        "宝石のかけらで石碑の謎を解き、新しい道が開かれました。",
        "木製のフルートで動物をなだめ、その場をやり過ごしました。"
      ],
      "Roll_16_19": [
        "無限の力の剣で大敵を討ち、貴族から高額の賞金を得ました。",
        "神聖なるにんじんのキャンドルで秘密の通路を照らし、宝箱を発見しました。",
        "スナップトラップ2000で強力なトラップを仕掛け、大量の銀貨と貴重品を手に入れました。",
        "侦察兵号角で敵を見つけ出し、見事に打ち勝ち、豪華な報酬を得ました。",
        "神秘のレシピで究極の薬を作り出し、多くの王と貴族から報酬を得ました。",
        "妖气水晶球で未来を予知し、隠された財宝を発見しました。",
        "修补匠的工具で壊れた装置を修理し、大量の金貨と貴重品を得ました。",
        "新力奖章を使用して英勇な行動をし、王から大量の金貨を得ました。",
        "玄秘药剂で壮大な魔法を発動させ、大量の宝石と貴金属を手に入れました。",
        "大力巨剑で怪物の大群を撃退し、地元の村人から大量の報酬を得ました。",
        "パッチーのツールで崩れそうな壁を修理し、大量の貴重品を発見しました。",
        "キラキラメダルで英勇な行動をしたことを称賛され、大量の貴金属を得ました。",
        "ミニホルンで勇敢な歌を歌い、多くの貴族から報酬を得ました。",
        "大地を裂く斧で山を二つに裂き、大量の貴金属を発見しました。",
        "貴族の紋章を使って交渉し、多くの土地と貴金属を獲得しました。",
        "黄金の羽を使って高い山に飛び、隠された財宝を見つけました。",
        "不死鳥の涙で瀕死の人々を救い、大量の貴重品を得ました。",
        "タイムマシンで過去に戻り、貴重な遺物を持ち帰りました。",
        "巨大な盾で村を救い、豪華な報酬を得ました。",
        "魔法のハープで大地を癒し、王から大量の報酬を得ました。"
      ],
      "Roll_Nat_20": [
        "伝説の剣で強大な敵を討ち、驚異的な報酬を獲得しました。",
        "天使の羽で新たな世界に飛び、宝の山を見つけました。",
        "魔法の錠前で禁断の扉を解き、秘密の力を手に入れました。",
        "時を制御する砂時計で未来を変え、財宝を山ほど手に入れました。",
        "鳳凰の涙で奇跡を起こし、王国全体から報酬と称賛を受けました。",
        "黄金のリンゴで神々を魅了し、神秘的な力を授かりました。",
        "古代の地図で隠された財宝を発見し、名声と富を得ました。",
        "龍の心臓で不死の薬を作り、永遠の命と富を得ました。",
        "魔法の竪琴で宇宙の調和を感じ、願い事一つかなえてもらいました。",
        "不死鳥の羽根で時間を超越し、数々の財宝と冒険を手に入れました。",
        "神々の宝石で新しい次元を開き、未知の領域で富を築きました。",
        "七色の鱼で海神を喜ばせ、神々の恩恵を受けました。",
        "聖なる杖で呪いを解き、多くの国から感謝と報酬を得ました。",
        "黄金の鎌で命運を切り開き、宇宙的な富と知識を得ました。",
        "夢幻のクリスタルで幻想世界を救い、多くの賞賛と報酬を得ました。",
        "楽園の花で神秘的な場所を開放し、永遠の幸福と富を得ました。",
        "神秘的な塔で未知の力を解き放ち、無尽蔵の富を得ました。",
        "魔法の笛で神々の歌を奏で、願いが何でもかなう力を得ました。",
        "謎めいた遺物で過去の秘密を解明し、国王から大報酬を得ました。",
        "不可能なるクエストを完了し、歴史に名を刻む報酬を獲得しました。"
      ]
    }
}
