{
    "bot_messages" : 
    {
        "start_message_under_10_members": "Trust No Bunny 봇이 이 서버에서 활동을 시작했습니다! 서버가 적어도 10명의 멤버에 도달하면 Count Cornelio의 대상은 여기에서 정차합니다. 현재 드롭을 위해 {roll_command} 명령을 사용하세요. 대상이 정차할 채널을 설정하려면 {channel_set_command}을 사용하세요. 부정하게 얻은 이익으로 보상을 받으려면 play.friendlypixel.com으로 이동하세요.",
        "start_message_10_members": "Trust No Bunny 봇이 이 서버에서 활동을 시작했습니다! 서버가 적어도 10명의 멤버에 도달하면 Count Cornelio의 대상은 여기에서 정차합니다. 현재 드롭을 위해 {roll_command} 명령을 사용하세요. 대상이 정차할 채널을 설정하려면 {channel_set_command}을 사용하세요. 부정하게 얻은 이익으로 보상을 받으려면 play.friendlypixel.com으로 이동하세요.",
        "caravan_stop": "사악한 Count Cornelio의 대상이 오늘 밤 마을에서 정차하고 있습니다. 그의 부정하게 얻은 이익 중 일부를 습득하려면 어떻습니까? {roll_command}를 사용하여 침투하고 보물을 찾아보세요!"
    },
    "command_interactions" :
    {
        "language_command" :
        {
            "name": "/언어",
            "description": "Trust No Bunny 봇의 언어를 설정합니다.",
            "language_set": "Trust No Bunny 봇의 언어가 성공적으로 {language}로 설정되었습니다."
        },
        "roll_command" : 
        {
            "name": "/주사위",
            "description": "바론의 짐마차에 침투하기 위해 20면 주사위를 굴립니다  ",
            "no_drop": "죄송합니다, 이 서버에서 공격할 캐러밴을 찾지 못했습니다.",
            "already_raided": "죄송합니다, 이미 이 캐러밴을 공격한 것 같네요. 나중에 다시 오셔서 기회를 얻으세요.",
            "rolling_dice": "20면체 주사위를 굴리는 중...",
            "rolled_1": "1을 굴렸습니다! 불운이네요, 서버 수정자가 적용되지 않습니다!",
            "rolled_1_found": "아무 것도 찾지 못했습니다! 캐러밴이 다시 도착했을 때 다시 확인하세요.",
            "rolled_result": "{diceroll}을(를) 굴렸습니다! 서버 크기 수정자는 {server_size_modifier}이고 총합은 {combined}입니다.",
            "rolled_found": "{reward_title}을(를) 찾았습니다. Trust No Bunny (play.friendlypixel.com)에서 보상을 받으세요. 게임 내에서 Discord가 연결되어 있는지 확인하세요."
        }, 
        "channel_set_command" : 
        {
            "name": "/채널 설정",
            "description": "카운트 코르넬리오의 캐러밴이 멈출 채널을 설정합니다.",
            "channel_set_option": "카운트 코르넬리오의 캐러밴이 멈출 채널을 선택하세요",
            "message": "카운트 코르넬리오의 캐러밴의 기본 채널이 성공적으로 설정되었습니다"
        }, 
        "droptable_command" : 
        {
            "name": "/드롭테이블",
            "description": "드롭 테이블의 각 아이템에 대한 주사위 굴림 요구사항을 가져옵니다.",
            "base_dice_roll_requirements": "서버 크기가 {server_size}인 경우, 드롭 테이블의 각 아이템에 대한 기본 주사위 굴림 요구사항은 다음과 같습니다:\n\n",
            "server_size_modifier": "\n이 서버의 서버 크기 수식어는 {server_size_modifier}입니다.\n\n"
        },
        "help_command" : 
        {
          "name": "/도움",
          "description": "Trust No Bunny 봇 도움말",
          "message": "Trust No Bunny 봇이 서버에 설치되면, 악명 높은 카운트 코르넬리오의 대열이 이곳에 정차하기 시작합니다. 그가 정차하면 {roll_command} 명령어를 사용하여 그의 대열을 습격하세요. {channel_set_command}을 사용하여 대열이 정차할 채널을 설정하세요. {droptable_command}을 사용하여 얼마나 많은 돈을 얻을 수 있는지 확인하세요. 대열은 정차할 때마다 한 번만 습격할 수 있지만, 보상을 받을 수 있는 서버의 수에는 제한이 없습니다. 불법으로 얻은 이익을 사용하여 보상을 받으려면 play.friendlypixel.com로 이동하세요."
        }        
    },
    "roll_responses" : 
    {
      "Roll_Nat_1": [
        "신성한 당근 양초를 불쌍하게 사용하여 대상을 밝게 해, 남작의 경비에게 당신의 위치를 노출시켰습니다.",
        "무한 동력의 검이 당신을 보이지 않게 만들 것이라고 순진하게 생각하여, 남작의 경비를 바로 마주쳤습니다. 이제 그들은 웃고 가리키고 있습니다.",
        "스냅 트랩 2000을 설치하던 중 발에 끼워 버렸으며 아무 것도 얻지 못했습니다.",
        "패치의 도구로 자물쇠를 풀려고 했으나, 도구가 고장났습니다.",
        "수상쩍은 전조의 수정 구슬로 미래를 보려고 했으나 아무 것도 보이지 않았습니다.",
        "侦察兵号角로 경보를 울렸고, 모든 은밀한 작업이 실패했습니다.",
        "新力奖章를 사용하여 용기를 얻으려고 했지만, 대신 자신을 밝혀 버렸습니다.",
        "玄秘药剂의 레시피를 읽어 보았으나, 전혀 이해할 수 없었습니다.",
        "胡萝卜圣烛로 조명을 켜려고 했으나, 불꽃이 꺼져 버렸습니다.",
        "大力巨剑로 적을 물리치려고 했으나, 대신 검이 부러져 버렸습니다.",
        "패치의 도구로 상자를 열려고 했으나, 안에는 아무것도 없었습니다.",
        "스냅 트랩 2000으로 함정을 설치했으나, 자신이 걸렸습니다.",
        "수상쩍은 전조의 수정 구슬로 운세를 점쳤으나, 결과는 최악이었습니다.",
        "侦察兵号角을 불어 동료를 부르려고 했으나, 적이 왔습니다.",
        "新力奖章을 달았으나, 그것이 원인으로 적에게 발견되었습니다.",
        "신비로운 레시피로 마법의 포션을 만들려고 했으나, 실패로 끝났습니다.",
        "胡萝卜圣烛로 길을 밝히려고 했으나, 오히려 눈에 띄게 되었습니다.",
        "무한 동력의 검을 휘둘러 보았으나, 아무 일도 일어나지 않았습니다.",
        "패치의 도구로 함정을 설치하려고 했으나, 오히려 함정에 걸렸습니다.",
        "스냅 트랩 2000을 설치하려고 했으나, 잘못하여 자신의 발에 설치했습니다."
    ]
    ,
      "Roll_2_10": [
        "신성한 당근 양초를 켜서 작은 방을 밝히고, 그곳에 있는 조금의 은화를 찾았습니다.",
        "무한 동력의 검으로 카라반의 방어를 약간 뚫고, 작은 덩어리의 은화를 가져왔습니다.",
        "신비로운 레시피를 사용하여 약간의 은화를 만들었습니다.",
        "패치의 도구로 조금의 시간을 투자하여 작은 양의 은화를 얻었습니다.",
        "빛나는 대형 메달 보석을 사용하여 사람들의 주의를 끌고 조금의 은화를 얻었습니다.",
        "스냅 트랩 2000을 사용하여 작은 양의 은화를 얻었습니다.",
        "이어혼을 사용하여 주위를 철저히 관찰하고 약간의 은화를 발견했습니다.",
        "수상쩍은 전조의 수정 구슬로 미래를 예측하고 조금의 은화를 찾았습니다.",
        "신성한 당근 양초를 사용하여 은밀한 장소에서 약간의 은화를 발견했습니다。",
        "무한 동력의 검으로 약간의 은화를 잘라냈습니다.",
        "신비로운 레시피로 만든 약을 사용하여 약간의 은화를 얻었습니다.",
        "패치의 도구를 사용하여 약간의 은화를 수정했습니다.",
        "빛나는 대형 메달 보석을 사용하여 약간의 은화를 얻었습니다.",
        "스냅 트랩 2000을 사용하여 약간의 은화를 얻었습니다.",
        "이어혼을 사용하여 약간의 은화를 발견했습니다.",
        "수상쩍은 전조의 수정 구슬로 약간의 은화를 찾았습니다.",
        "신성한 당근 양초를 사용하여 약간의 은화를 얻었습니다。",
        "무한 동력의 검으로 약간의 은화를 얻었습니다.",
        "신비로운 레시피로 만든 약을 사용하여 약간의 은화를 얻었습니다.",
        "패치의 도구를 사용하여 약간의 은화를 수정했습니다."
      ],
      "Roll_11_15": [
        "금의 검으로 가벼운 적을 물리치고, 약간의 보상을 받았습니다.",
        "빛의 펜던트로 비밀문을 비추고, 소중한 것을 발견했습니다.",
        "동전 함정으로 작은 사냥감을 잡고, 약간의 귀중품을 얻었습니다.",
        "작은 뿔피리로 적의 움직임을 발견하고, 적당한 보상을 받았습니다.",
        "기본 물약 레시피로 건강 물약을 만들고, 소액의 보상을 받았습니다.",
        "크리스탈 오브로 약간의 미래를 엿보고, 작은 보물을 발견했습니다.",
        "수선용 실로 옷을 고쳐, 감사와 함께 약간의 금화를 받았습니다.",
        "용기의 메달을 보여주고, 약간의 보상과 칭찬을 받았습니다.",
        "기본 마법 물약으로 작은 기적을 일으키고, 약간의 보석을 얻었습니다.",
        "단검으로 습격하는 적을 물리치고, 근처 마을 사람들로부터 감사와 보상을 받았습니다.",
        "수리검으로 먼 타겟을 맞히고, 소액의 보상을 얻었습니다.",
        "작은 방패로 동료를 보호하고, 감사를 받았습니다.",
        "휘파람으로 아름다운 멜로디를 연주하고, 약간의 금화와 함께 감사를 받았습니다.",
        "슬링샷으로 과일을 얻고, 약간의 음식과 함께 감사를 받았습니다.",
        "가죽 방패로 명중률을 높이고, 목표를 성공적으로 노렸습니다.",
        "통나무 다리를 고쳐, 통행료로 약간의 보상을 받았습니다.",
        "간단한 돌 함정으로 동물을 잡고, 약간의 음식을 얻었습니다.",
        "수제 나침반으로 길을 찾고, 목적지에 도착했습니다.",
        "보석 조각으로 비석의 수수께끼를 풀고, 새로운 길이 열렸습니다.",
        "나무 플루트로 동물을 달래고, 그 자리를 빠져나왔습니다."
      ],
      "Roll_16_19": [
        "무한의 힘을 가진 검으로 큰 적을 물리치고, 귀족으로부터 높은 금액의 상금을 받았습니다.",
        "신성한 당근 양초로 비밀 통로를 비추어 보물 상자를 발견했습니다.",
        "스냅 트랩 2000으로 강력한 함정을 만들어 큰 양의 은화와 귀중품을 얻었습니다.",
        "탐색호른으로 적을 찾아내어 대단히 이겼고, 호화로운 보상을 받았습니다.",
        "신비한 레시피로 최고의 물약을 만들어 많은 왕과 귀족으로부터 보상을 받았습니다.",
        "요정 수정 구슬로 미래를 예측해 숨겨진 보물을 발견했습니다.",
        "수리공의 도구로 망가진 기계를 고쳐 큰 양의 금화와 귀중품을 얻었습니다.",
        "빛나는 대형 메달로 영웅적인 행동을 해 왕으로부터 많은 금화를 받았습니다.",
        "요술 약으로 웅장한 마법을 부리고, 많은 보석과 귀금속을 얻었습니다.",
        "거대한 검으로 몬스터 무리를 물리쳐, 현지 마을 사람들로부터 큰 보상을 받았습니다.",
        "패치의 도구로 무너질 위기에 처한 벽을 수리하고, 많은 귀중품을 발견했습니다.",
        "반짝이는 메달로 영웅적인 행동을 칭찬받아, 많은 귀금속을 얻었습니다.",
        "미니 호른으로 용감한 노래를 부르고, 많은 귀족으로부터 보상을 받았습니다.",
        "대지를 가르는 도끼로 산을 둘로 나눠, 많은 귀금속을 발견했습니다.",
        "귀족의 문장으로 협상하여 많은 땅과 귀금속을 얻었습니다.",
        "황금 날개로 높은 산으로 날아가 숨겨진 보물을 발견했습니다.",
        "불사조의 눈물로 위급한 사람들을 구해냈고, 많은 귀중품을 얻었습니다.",
        "시간 기계로 과거로 돌아가 귀중한 유물을 가져왔습니다.",
        "거대한 방패로 마을을 구했고, 호화로운 보상을 받았습니다.",
        "마법의 하프로 땅을 치유해 왕으로부터 많은 보상을 받았습니다."
      ],
      "Roll_Nat_20": [
        "전설의 검으로 거대한 적을 물리치고, 엄청난 보상을 받았습니다.",
        "천사의 날개로 새로운 세계로 날아가, 보물을 발견했습니다.",
        "마법의 자물쇠로 금지된 문을 열고, 비밀의 힘을 얻었습니다.",
        "시간을 조종하는 모래시계로 미래를 바꾸고, 엄청난 양의 보물을 얻었습니다.",
        "불사조의 눈물로 기적을 일으키고, 전국으로부터 보상과 찬사를 받았습니다.",
        "황금 사과로 신들을 매료시켜, 신비로운 힘을 받았습니다.",
        "고대 지도로 숨겨진 보물을 찾아, 명성과 부를 얻었습니다.",
        "용의 심장으로 불멸의 물약을 만들어, 영원한 생명과 부를 얻었습니다.",
        "마법의 하프로 우주의 조화를 느껴, 소원을 하나 이루어주었습니다.",
        "불사조의 깃털로 시간을 넘어, 수많은 보물과 모험을 얻었습니다.",
        "신들의 보석으로 새로운 차원을 열고, 알려지지 않은 영역에서 부를 쌓았습니다.",
        "칠색의 물고기로 바다의 신을 기쁘게 해, 신들의 은총을 받았습니다.",
        "성스러운 지팡이로 저주를 풀고, 많은 나라로부터 감사와 보상을 받았습니다.",
        "황금 낫으로 운명을 개척해, 우주적인 부와 지식을 얻었습니다.",
        "환상의 크리스탈로 판타지 세계를 구해, 많은 찬사와 보상을 받았습니다.",
        "천국의 꽃으로 신비한 장소를 열고, 영원한 행복과 부를 얻었습니다.",
        "신비한 탑에서 알려지지 않은 힘을 해방해, 무한한 부를 얻었습니다.",
        "마법의 플루트로 신들의 노래를 연주해, 소원을 뭐든지 이루어주는 힘을 얻었습니다.",
        "수수께끼의 유물로 과거의 비밀을 밝혀, 왕으로부터 큰 보상을 받았습니다.",
        "불가능한 퀘스트를 완료해, 역사에 이름을 남기는 보상을 얻었습니다."
      ]
    }
}
