{
    "bot_messages" : 
    {
        "start_message_under_10_members": "Trust No Bunny 机器人现在在这个服务器中活跃！一旦服务器达到至少10名成员，Count Cornelio的商队就会在这里停留。使用{roll_command}命令来抢夺当前的掉落物。使用{channel_set_command}来设置商队将停留的频道。要使用你不正当获得的收益兑换奖励，请前往 play.friendlypixel.com。",
        "start_message_10_members": "Trust No Bunny 机器人现在在这个服务器中活跃！一旦服务器达到至少10名成员，Count Cornelio的商队就会在这里停留。使用{roll_command}命令来抢夺当前的掉落物。使用{channel_set_command}来设置商队将停留的频道。要使用你不正当获得的收益兑换奖励，请前往 play.friendlypixel.com。",
        "caravan_stop": "邪恶的 Count Cornelio 的商队今晚将停留在城里。你敢不敢冒险拿走他不正当获得的财富？使用 {roll_command} 来潜入并寻找财宝！"
    },
    "command_interactions" :
    {
        "language_command" : 
        {
            "name": "/语言",
            "description": "更改机器人的语言。",
            "language_set": "机器人语言已成功设置为{language}"
        },
        "roll_command" : 
        {
            "name": "/掷骰",
            "description": "投掷20面骰子以渗透男爵的商队",
            "no_drop": "对不起，我们没能在这个服务器找到可袭击的商队。",
            "already_raided": "对不起，看来您已经袭击过这辆商队了。请稍后再来尝试。",
            "rolling_dice": "正在掷一个20面的骰子...",
            "rolled_1": "你掷出了1！不走运，服务器修正值不适用！",
            "rolled_1_found": "你什么都没找到！等商队再次停靠时再来看看。",
            "rolled_result": "你掷出了{diceroll}！服务器规模修正值是{server_size_modifier}，总计是{combined}。",
            "rolled_found": "你找到了{reward_title}。在Trust No Bunny（play.friendlypixel.com）中兑换。确保你的Discord已在游戏中连接，以查看你的奖励。"
        }, 
        "channel_set_command" : 
        {
            "name": "/频道 设置",
            "description": "设置康特·科尔内利奥的商队将停留的频道。",
            "channel_set_option": "您希望康特·科尔内利奥的商队停留的频道",
            "message": "康特·科尔内利奥的商队的默认频道已成功设置"
        }, 
        "droptable_command" : 
        {
            "name": "/掉落表",
            "description": "获取掉落表中每个项目的骰子掷骰要求。",
            "base_dice_roll_requirements": "服务器大小为{server_size}时，掉落表中每个项目的基础骰子掷骰要求如下：\n\n",
            "server_size_modifier": "\n该服务器的服务器大小修饰符是{server_size_modifier}。\n\n"
        },
        "help_command" : 
        {
            "name": "/帮助",
            "description": "Trust No Bunny 机器人帮助",
            "message": "当 Trust No Bunny 机器人安装在您的服务器时，恶名昭彰的康特·康内利奥的商队将开始在这里停靠。当他停下来时，使用 {roll_command} 命令去劫掠他的商队。使用 {channel_set_command} 设置商队将停靠的频道。使用 {droptable_command} 查看掷骰的金额可以带给您什么。您只能在商队每次停靠时劫掠一次，但兑换奖励的服务器数量没有限制。要用您不正当的收益兑换奖励，请访问 play.friendlypixel.com。"
        }        
    },
    "roll_responses" : 
    {
      "Roll_Nat_1": [
        "在用胡萝卜圣烛的笨拙动作中，你不小心照亮了商队，暴露了自己的位置给男爵的卫兵。",
        "天真地以为大力巨剑会让你变得隐形，你径直走进了男爵的卫兵。他们现在在笑着指着你。",
        "在设置捕猎陷阱 2000的过程中，你的脚被夹住了，一无所获。",
        "试图用修补匠的工具打开锁，但工具坏了。",
        "用妖气水晶球试图看到未来，但什么都没看到。",
        "用侦察兵号角吹响警报，所有秘密行动都失败了。",
        "试图用新力奖章鼓起勇气，但反而暴露了自己。",
        "尝试阅读玄秘药剂的配方，但完全无法理解。",
        "用胡萝卜圣烛试图点亮灯，但火焰熄灭了。",
        "用大力巨剑试图击败敌人，但反而剑断了。",
        "用修补匠的工具试图打开箱子，但里面什么都没有。",
        "用捕猎陷阱 2000设置了一个陷阱，但自己却掉了进去。",
        "用妖气水晶球算了一卦，结果是大凶。",
        "吹了侦察兵号角试图召唤盟友，但敌人来了。",
        "佩戴了新力奖章，但因此被敌人发现了。",
        "尝试用玄秘药剂制作魔法药水，但以失败告终。",
        "用胡萝卜圣烛试图照亮路，但反而更加引人注目。",
        "挥舞了大力巨剑，但什么也没有发生。",
        "用修补匠的工具试图设置一个陷阱，但反而自己掉了进去。",
        "试图设置捕猎陷阱 2000，但错误地放在了自己的脚下。"        
      ],
      "Roll_2_10": [
        "点亮了胡萝卜圣烛，在微弱的光线下找到了少量的银币。",
        "使用大力巨剑轻微地破开了商队的防御，带回了一些银币。",
        "用玄秘药剂制造出一些银币。",
        "用修补匠的工具花了点时间，最终找到了一些银币。",
        "展示新力奖章，成功分散了人们的注意力，拿到了一些银币。",
        "使用捕猎陷阱 2000成功捕获了一些银币。",
        "吹响侦察兵号角，仔细观察四周，找到了一些银币。",
        "用妖气水晶球预知未来，找到了一些银币。",
        "使用胡萝卜圣烛找到了一个隐蔽的地方，并在那里找到了一些银币。",
        "用大力巨剑切下了一些银币。",
        "使用玄秘药剂得到了一些银币。",
        "吹响侦察兵号角，找到了一些银币。",
        "用修补匠的工具修理了一些银币。",
        "展示新力奖章，得到了一些银币。",
        "使用捕猎陷阱 2000得到了一些银币。",
        "用妖气水晶球找到了一些银币。",
        "使用胡萝卜圣烛得到了一些银币。",
        "用大力巨剑得到了一些银币。",
        "使用玄秘药剂得到了一些银币。",
        "用修补匠的工具修理了一些银币。"
      ],
      "Roll_11_15": [
        "用金剑击败了轻微的敌人，获得了一些奖励。",
        "用光之吊坠照亮了秘密的门，发现了一些贵重的东西。",
        "用铜制的陷阱捉到了小猎物，获得了少量的贵重物品。",
        "用小号角找到了敌人的动向，获得了适量的奖励。",
        "用基础药水配方制作了健康药水，获得了少量的奖励。",
        "用水晶球窥视了一点未来，找到了小型的财宝。",
        "用修补线修补了衣物，得到了一些感激和金币。",
        "展示了勇气勋章，获得了少量的奖励和赞誉。",
        "用基础魔法药剂创造了小奇迹，获得了少量的宝石。",
        "用短剑击退了攻击的敌人，得到了附近村民的感激和奖励。",
        "用飞镖命中了远处的目标，获得了少量的奖励。",
        "用小盾牌保护了伙伴，得到了一些感激。",
        "用口哨吹奏了美丽的旋律，获得了一些金币和感激。",
        "用弹弓得到了一些水果，得到了少量的食物和感激。",
        "用皮质背心提高了命中率，成功击中了目标。",
        "修复了木制的桥梁，作为通行费获得了少量的奖励。",
        "用简单的石制陷阱捉到了动物，获得了少量的食物。",
        "用手工制作的指南针找到了方向，成功到达了目的地。",
        "用宝石碎片解决了石碑的谜题，打开了新的路径。",
        "用木制的长笛平息了动物，成功脱离了困境。"
      ],
      "Roll_16_19": [
        "用无限之剑击败了强大的敌人，获得了贵族给予的丰厚赏金。",
        "点亮了胡萝卜圣烛，照亮了一条秘密通道，并在其中找到了一个宝箱。",
        "使用捕猎陷阱2000成功捕获了大量的银币和珍贵物品。",
        "吹响侦察兵号角，发现了敌人并成功击败，获得了豪华的奖励。",
        "用玄秘药剂制作了至强的药剂，赢得了多个国王和贵族的奖赏。",
        "用妖气水晶球预测了未来，找到了隐藏的财宝。",
        "用修补匠的工具修复了一台破损的机器，得到了大量的金币和珍贵物品。",
        "展示新力奖章，因英勇行为获得了大量的金币。",
        "用玄秘药剂施展了宏大的魔法，得到了大量的宝石和贵金属。",
        "用大力巨剑击退了一群怪物，获得了当地村民提供的丰厚奖励。",
        "用修补匠的工具修理了一个即将崩塌的墙壁，找到了大量的珍贵物品。",
        "展示新力奖章，因此受到了赞扬并获得了大量的贵金属。",
        "用小号角吹奏了英勇的歌曲，赢得了多个贵族的奖赏。",
        "用裂地之斧劈开了一座山，找到了大量的贵金属。",
        "利用贵族纹章进行了谈判，获得了大量的土地和贵金属。",
        "用黄金翅膀飞到了高山上，找到了隐藏的财宝。",
        "用凤凰之泪救治了濒临死亡的人们，得到了大量的珍贵物品。",
        "用时光机返回了过去，带回了珍贵的文物。",
        "用巨大的盾牌保护了一个村庄，因此获得了豪华的奖励。",
        "用魔法竖琴治愈了大地，获得了王者给予的丰厚奖励。"
      ],
      "Roll_Nat_20": [
        "用传说中的剑击败了强大的敌人，获得了惊人的奖励。",
        "用天使的翅膀飞到了新世界，找到了宝藏。",
        "用魔法锁打开了禁止之门，获得了秘密的力量。",
        "用控制时间的沙漏改变了未来，得到了大量的财宝。",
        "用凤凰的眼泪创造了奇迹，得到了全国的奖赏和称赞。",
        "用金色的苹果吸引了神祇，获得了神秘的力量。",
        "用古老的地图找到了隐藏的财宝，获得了声誉和财富。",
        "用龙的心制造了不死之药，得到了永生和财富。",
        "用魔法竖琴感受了宇宙的和谐，实现了一个愿望。",
        "用不死鸟的羽毛超越了时间，得到了许多财宝和冒险。",
        "用神之宝石开启了新的维度，获得了未知领域的财富。",
        "用七彩的鱼讨好了海神，得到了神的恩惠。",
        "用神圣的法杖解除了诅咒，得到了多个国家的感谢和奖赏。",
        "用金色的镰刀开启了命运，得到了宇宙的财富和知识。",
        "用梦幻的水晶拯救了幻想世界，得到了许多赞誉和奖赏。",
        "用天堂的花开启了神秘的地方，得到了永恒的幸福和财富。",
        "用神秘的塔释放了未知的力量，获得了无穷的财富。",
        "用魔法长笛演奏了神之歌，得到了实现任何愿望的力量。",
        "用神秘的文物揭示了过去的秘密，从国王那里得到了巨额的奖赏。",
        "完成了不可能的任务，得到了载入历史的奖励。"
      ]
    }
}
